_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
pool1 (AveragePooling2D)     (None, 30, 30, 1)         0         
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 15, 15, 1)         0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 15, 15, 1)         4         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 5, 5, 1024)        9216      
_________________________________________________________________
batch_normalization_2 (Batch (None, 5, 5, 1024)        4096      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 2, 2, 512)         2097152   
_________________________________________________________________
batch_normalization_3 (Batch (None, 2, 2, 512)         2048      
_________________________________________________________________
flatten (Flatten)            (None, 2048)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              2098176   
_________________________________________________________________
batch_normalization_4 (Batch (None, 1024)              4096      
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
batch_normalization_5 (Batch (None, 1024)              4096      
_________________________________________________________________
dense_3 (Dense)              (None, 1024)              1049600   
_________________________________________________________________
batch_normalization_6 (Batch (None, 1024)              4096      
_________________________________________________________________
softmax (Dense)              (None, 3)                 3075      
=================================================================
Total params: 6,325,255
Trainable params: 6,316,037
Non-trainable params: 9,218
_________________________________________________________________